quiz_data = [
    # Программирование (3 вопроса)
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0,
        'topic': 'programming'
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0,
        'topic': 'programming'
    },
    {
        'question': 'Что означает ООП в программировании?',
        'options': ['Основные Операционные Процедуры', 'Объектно-Ориентированное Программирование',
                    'Общая Организация Проекта', 'Оптимальное Объемное Проектирование'],
        'correct_option': 1,
        'topic': 'programming'
    },
    {
        'question': 'Какой язык программирования создал Guido van Rossum?',
        'options': ['Java', 'Python', 'C++', 'JavaScript'],
        'correct_option': 1,
        'topic': 'programming'
    }

    # Животные (3 вопроса)
    {
        'question': 'Какое животное является самым быстрым на суше?',
        'options': ['Лев', 'Гепард', 'Антилопа Гну', 'Борзая'],
        'correct_option': 1,
        'topic': 'animals'
    },
    {
        'question': 'Сколько сердец у осьминога?',
        'options': ['Одно', 'Два', 'Три', 'Четыре'],
        'correct_option': 2,
        'topic': 'animals'
    },
    {
        'question': 'Какое млекопитающее умеет летать?',
        'options': ['Белка-летяга', 'Летучая мышь', 'Обезьяна', 'Кошка'],
        'correct_option': 1,
        'topic': 'animals'
    },

    # Новые технологии (3 вопроса)
    {
        'question': 'Что такое ИИ (Искусственный Интеллект)?',
        'options': ['Новый тип компьютера', 'Способность машин имитировать человеческий интеллект', 'Язык программирования',
                    'Социальная сеть'],
        'correct_option': 1,
        'topic': 'tech'
    },
    {
        'question': 'Что такое блокчейн?',
        'options': ['Новый процессор', 'Децентрализованная база данных', 'Тип антивируса', 'Игровая консоль'],
        'correct_option': 1,
        'topic': 'tech'
    },
    {
        'question': 'Какая технология лежит в основе VR (виртуальной реальности)?',
        'options': ['Искусственный интеллект', 'Блокчейн', '3D-визуализация и отслеживание движений',
                    'Квантовые вычисления'],
        'correct_option': 2,
        'topic': 'tech'
    }
]